{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"1993"},"rawString":{"#tail":"\n","#text":"Hideki Kozima. 1993. Text segmentation based on similarity between words. In Proceedings of ACL '93, pages 286-288, Ohio."},"#text":"\n","pages":{"#tail":"\n","#text":"286--288"},"marker":{"#tail":"\n","#text":"Kozima, 1993"},"location":{"#tail":"\n","#text":"Ohio."},"contexts":{"#tail":"\n","#text":"\n","context":[{"#tail":"\n","#text":"wice as accurate and over seven times as fast as the state-of-the-art (Reynar, 1998). Inter-sentence similarity is replaced by rank in the local context. Boundary locations are discovered by divisive clustering. 1 Introduction Even moderately long documents typically address several topics or different aspects of the same topic. The aim of linear text segmentation is to discover the topic boundaries. The uses of this procedure include information retrieval (Hearst and Plaunt, 1993; Hearst, 1994; Yaari, 1997; Reynar, 1999), summarization (Reynar, 1998), text understanding, anaphora resolution (Kozima, 1993), language modelling (Morris and Hirst, 1991; Beeferman et al., 1997b) and improving document navigation for the visually disabled (Choi, 2000). This paper focuses on domain independent methods for segmenting written text. We present a new algorithm that builds on previous work by Reynar (Reynar, 1998; Reynar, 1994). The primary distinction of our method is the use of a ranking scheme and the cosine similarity measure (van Rijsbergen, 1979) in formulating the similarity matrix. We propose that the similarity values of short text segments is statistically insignificant. Thus, one can only rely ","@endWordPosition":"123","@position":"890","annotationId":"T1","@startWordPosition":"122","@citStr":"Kozima, 1993"},{"#tail":"\n","#text":"lustering. 2 Background Existing work falls into one of two categories, lexical cohesion methods and multi-source methods (Yaari, 1997). The former stem from the work of Halliday and Hasan (Halliday and Hasan, 1976). They proposed that text segments with similar vocabulary are likely to be part of a coherent topic segment. Implementations of this idea use word stem repetition (Youmans, 1991; Reynar, 1994; Ponte and Croft, 1997), context vectors (Hearst, 1994; Yaari, 1997; Kaufmann, 1999; Eichmann et al., 1999), entity repetition (Kan et al., 1998), semantic similarity (Morris and Hirst, 1991; Kozima, 1993), word distance model (Beeferman et al., 1997a) and word frequency model (Reynar, 1999) to detect cohesion. Methods for finding the topic boundaries include sliding window (Hearst, 1994), lexical chains (Morris, 1988; Kan et al., 1998), dynamic programming (Ponte and Croft, 1997; Heinonen, 1998), agglomerative clustering (Yaari, 1997) and divisive clustering (Reynar, 1994). Lexical cohesion methods are typically used for segmenting written text in a collection to improve information retrieval (Hearst, 1994; Reynar, 1998). Multi-source methods combine lexical cohesion with other indicators of t","@endWordPosition":"321","@position":"2133","annotationId":"T2","@startWordPosition":"320","@citStr":"Kozima, 1993"},{"#tail":"\n","#text":"ent instead of dot density for measuring similarity. It incorporates the optimisations described 7The full derivation of our method is available from the author. 3-11 3-5 6-8 9-11 H94(,,d) 46% 44% 43% 48% H94(,,,,) 46% 44% 44% 49% H94(3,,,) 54% 45% 52% 53% H94(C(l) 0.67s 0.52s 0.66s 0.88s H94(c,r) 0.68s 0.52s 0.67s 0.92s H94(j,r) 3.77s 2.21s 3.69s 5.07s Table 3: The error rate and speed performance of TextTiling. in section 3.4. R98(,„,d0t) is the modularised version of R98 for experimenting with different similarity measures. R98(,,,,„) uses a variant of Kozima's semantic similarity measure (Kozima, 1993) to compute block similarity. Word similarity is a function of word cooccurrence statistics in the given document. Words that belong to the same sentence are considered to be related. Given the co-occurrence frequencies f (wi, wi), the transition probability matrix t is computed by equation 10. Equation 11 defines our spread activation scheme. s denotes the word similarity matrix, x is the number of activation steps and norm(y) converts a matrix y into a transition matrix. x = 5 was used in the experiment. f ti,j = p(wi I ) = Ei f ti) ) Experimental result (table 4) shows the cosine coefficien","@endWordPosition":"2508","@position":"14615","annotationId":"T3","@startWordPosition":"2507","@citStr":"Kozima, 1993"},{"#tail":"\n","#text":"n/a 21.43s 65.54s 129.3s Table 8: A summary of our experimental results. 5 Conclusions and future work A segmentation algorithm has two key elements, a, clustering strategy and a similarity measure. Our 31 results show divisive clustering (R98) is more precise than sliding window (H94) and lexical chains (K98) for locating topic boundaries. Four similarity measures were examined. The cosine coefficient (R98(s,„0) and dot density measure (R98(m,doo ) yield similar results. Our spread activation based semantic measure (R98(„,sa)) improved accuracy. This confirms that although Kozima's approach (Kozima, 1993) is computationally expensive, it does produce more precise segmentation. The most significant improvement was due to our ranking scheme which linearises the cosine coefficient,. Our experiments demonstrate that given insufficient data, the qualitative behaviour of the cosine measure is indeed more reliable than the actual values. Although our evaluation scheme is sufficient for this comparative study, further research requires a large scale, task independent benchmark. It would be interesting to compare C99 with the multi-source method described in (Beeferman et al., 1999) using the TDT corpu","@endWordPosition":"3456","@position":"20010","annotationId":"T4","@startWordPosition":"3455","@citStr":"Kozima, 1993"}]},"title":{"#tail":"\n","#text":"Text segmentation based on similarity between words."},"booktitle":{"#tail":"\n","#text":"In Proceedings of ACL '93,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":{"#tail":"\n","#text":"Hideki Kozima"}}}}}}}
