{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":[{"#tail":"\n","date":{"#tail":"\n","#text":"1998"},"rawString":{"#tail":"\n","#text":"C. Chelba and F. Jelinek. 1998. Exploiting syntactic structure for language modeling. In Proc. of the 36th ACL, Montreal, Canada."},"#text":"\n","marker":{"#tail":"\n","#text":"Chelba, Jelinek, 1998"},"location":{"#tail":"\n","#text":"Montreal, Canada."},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"es can be more time efficient in cases of grammar formalisms whose rules are specialized for one or more lexical items. In this paper we have provided an original mathematical argument in favour of this thesis. Our results hold for bilexical context-free grammars and directly transfer to several language models that can be seen as stochastic versions of this formalism (see Section 1). We perceive that these results can be extended to other language models that properly embed bilexical context-free grammars, as for instance the more general history-based models used in (Ratnaparkhi, 1997) and (Chelba and Jelinek, 1998). We leave this for future work. Acknowledgements We would like to thank Jason Eisner and Mehryar Mohri for fruitful discussions. The first author is supported by the German Federal Ministry of Education, Science, Research and Technology (BMBF) in the framework of the VERBMOBIL Project under Grant 01 IV 701 VO, and was employed at AT&T Shannon Laboratory during a part of the period this paper was written. The second author is supported by MURST under project PRIN: BioInformatica e Ricerca Genomica and by University of Padua, under project Sviluppo di Sisterni ad Addestramento Automatic° per l'","@endWordPosition":"4690","@position":"26581","annotationId":"T1","@startWordPosition":"4687","@citStr":"Chelba and Jelinek, 1998"}},"title":{"#tail":"\n","#text":"Exploiting syntactic structure for language modeling."},"booktitle":{"#tail":"\n","#text":"In Proc. of the 36th ACL,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"C Chelba"},{"#tail":"\n","#text":"F Jelinek"}]}},{"#tail":"\n","date":{"#tail":"\n","#text":"1997"},"institution":{"#tail":"\n","#text":"Brown University,"},"rawString":{"#tail":"\n","#text":"A. Ratnaparkhi. 1997. A linear observed time statistical parser based on maximum entropy models. In Second Conference on Empirical Methods in Natural Language Processing, Brown University, Providence, Rhode Island."},"#text":"\n","marker":{"#tail":"\n","#text":"Ratnaparkhi, 1997"},"location":{"#tail":"\n","#text":"Providence, Rhode Island."},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"ctional parsing strategies can be more time efficient in cases of grammar formalisms whose rules are specialized for one or more lexical items. In this paper we have provided an original mathematical argument in favour of this thesis. Our results hold for bilexical context-free grammars and directly transfer to several language models that can be seen as stochastic versions of this formalism (see Section 1). We perceive that these results can be extended to other language models that properly embed bilexical context-free grammars, as for instance the more general history-based models used in (Ratnaparkhi, 1997) and (Chelba and Jelinek, 1998). We leave this for future work. Acknowledgements We would like to thank Jason Eisner and Mehryar Mohri for fruitful discussions. The first author is supported by the German Federal Ministry of Education, Science, Research and Technology (BMBF) in the framework of the VERBMOBIL Project under Grant 01 IV 701 VO, and was employed at AT&T Shannon Laboratory during a part of the period this paper was written. The second author is supported by MURST under project PRIN: BioInformatica e Ricerca Genomica and by University of Padua, under project Sviluppo di Sisterni ad ","@endWordPosition":"4685","@position":"26550","annotationId":"T2","@startWordPosition":"4683","@citStr":"Ratnaparkhi, 1997"}},"title":{"#tail":"\n","#text":"A linear observed time statistical parser based on maximum entropy models."},"booktitle":{"#tail":"\n","#text":"In Second Conference on Empirical Methods in Natural Language Processing,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":{"#tail":"\n","#text":"A Ratnaparkhi"}}}]}}}}
