{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"1992"},"rawString":{"#tail":"\n","#text":"E. Brill. 1992. A simple rule-based part of speech tagger. In Proceeding of the Third Conference on Applied Natural Language Processing (ANLP-92), pages 152-155, Trento, Italy."},"#text":"\n","pages":{"#tail":"\n","#text":"152--155"},"marker":{"#tail":"\n","#text":"Brill, 1992"},"location":{"#tail":"\n","#text":"Trento, Italy."},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":" world's leading fashion designers, has been murdered in Miami. Police say it was a planned killing carried out like an execution. Schools inspections are going to be tougher to force bad teachers out. And the four thousand couples who shared the Queen's golden day. Figure 1: Example text shown in standard and ASR format ation which is not available in ASR output is sentence boundary information. However, knowledge of sentence boundaries is required by many NLP technologies. Part of speech taggers typically require input in the format of a single sentence per line (for example Brill's tagger (Brill, 1992)) and parsers generally aim to produce a tree spanning each sentence. Only the most trivial linguistic analysis can be carried out on text which is not split into sentences. It is worth mentioning that not all transcribed speech can be sensibly divided into sentences. It has been argued by Gotoh and Renals (2000) that the main unit in spoken language is the phrase rather than the sentence. However, there are situations in which it is appropriate to consider spoken language to be made up from sentences. One example is broadcast news: radio and television news programs. The DARPA HUB4 broadcast ","@endWordPosition":"532","@position":"3273","annotationId":"T1","@startWordPosition":"531","@citStr":"Brill, 1992"}},"title":{"#tail":"\n","#text":"A simple rule-based part of speech tagger."},"booktitle":{"#tail":"\n","#text":"In Proceeding of the Third Conference on Applied Natural Language Processing (ANLP-92),"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":{"#tail":"\n","#text":"E Brill"}}}}}}}
