{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"1998"},"rawString":{"#tail":"\n","#text":"Elmi, M. A. and Evens, M. W. 1998. Spelling Correction using Context. In Proceedings of the 17th COLING/36th ACL (COLING-ACL '98), Montreal."},"#text":"\n","marker":{"#tail":"\n","#text":"Elmi, Evens, 1998"},"location":{"#tail":"\n","#text":"Montreal."},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"nowledge base. Further details about the APE planner can be found in (Freedman, 2000). 5 Implementation of Atlas-Andes 5.1 Architecture of Atlas-Andes The first system we have implemented with APE is a prototype Atlas-Andes system that replaces the hints usually given for an incorrect acceleration vector by a choice of generated subdialogues. Figure 4 shows the architecture of Atlas-Andes; any other system built with APE would look similar. Robust natural language understanding in Atlas-Andes is provided by Rosé's CARMEL system (Rosé 2000); it uses the spelling correction algorithm devised by Elmi and Evens (1998). 5.2 Structure of human tutorial dialogues In an earlier analysis (Kim, Freedman and Evens 1998) we showed that a significant portion of human-human tutorial dialogues can be modeled with the hierarchical structure of task-oriented dialogues (Grosz and Sidner 1986). Furthermore, a main building block of the discourse hierarchy, corresponding to the transaction level in Conversation Analysis (Sinclair and Coulthard 1975), matches the tutoring episode defined by VanLehn et al. (1998). A tutoring episode consists of the turns necessary to help the student make one correct entry on the interface.","@endWordPosition":"2516","@position":"15492","annotationId":"T1","@startWordPosition":"2513","@citStr":"Elmi and Evens (1998)"}},"title":{"#tail":"\n","#text":"Spelling Correction using Context."},"booktitle":{"#tail":"\n","#text":"In Proceedings of the 17th COLING/36th ACL (COLING-ACL '98),"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"M A Elmi"},{"#tail":"\n","#text":"M W Evens"}]}}}}}}
