{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":[{"#tail":"\n","date":{"#tail":"\n","#text":"2007"},"rawString":{"#tail":"\n","#text":"Sittichai Jiampojamarn, Grzegorz Kondrak, and Tarek Sherif. 2007. Applying many-to-many alignments and hidden markov models to letter-to-phoneme conversion. In Proc. of NAACL-HLT, Rochester, New York, April."},"#text":"\n","marker":{"#tail":"\n","#text":"Jiampojamarn, Kondrak, Sherif, 2007"},"location":{"#tail":"\n","#text":"Rochester, New York,"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"t of four tested languages and reduce the error rates by 38% to 92%. The model’s errors are often reasonable misgeneralizations (e.g., assume regular conjugation where irregular would have been correct), and it is able to use even a small number of latent variables (including the latent alignment) to capture useful linguistic properties. In future work, we would like to identify a set of features, latent variables, and training methods that port well across languages and string-transduction tasks. We would like to use features that look at wide context on the input side, which is inexpensive (Jiampojamarn et al., 2007). Latent variables we wish to consider are an increased number of word classes; more flexible regions—see Petrov et al. (2007) on learning a state transition diagram for acoustic regions in phone recognition—and phonological features and syllable boundaries. Indeed, our local log-linear features over several aligned latent strings closely resemble the soft constraints used by phonologists (Eisner, 1997). Finally, rather than define a fixed set of feature templates as in Fig. 2, we would like to refine empirically useful features during training, resulting in language-specific backoff patterns ","@endWordPosition":"6407","@position":"37974","annotationId":"T1","@startWordPosition":"6404","@citStr":"Jiampojamarn et al., 2007"}},"title":{"#tail":"\n","#text":"Applying many-to-many alignments and hidden markov models to letter-to-phoneme conversion."},"booktitle":{"#tail":"\n","#text":"In Proc. of NAACL-HLT,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Sittichai Jiampojamarn"},{"#tail":"\n","#text":"Grzegorz Kondrak"},{"#tail":"\n","#text":"Tarek Sherif"}]}},{"#tail":"\n","date":{"#tail":"\n","#text":"2007"},"rawString":{"#tail":"\n","#text":"Slav Petrov, Adam Pauls, and Dan Klein. 2007. Learning structured models for phone recognition. In Proc. of EMNLP-CoNLL."},"#text":"\n","marker":{"#tail":"\n","#text":"Petrov, Pauls, Klein, 2007"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"., assume regular conjugation where irregular would have been correct), and it is able to use even a small number of latent variables (including the latent alignment) to capture useful linguistic properties. In future work, we would like to identify a set of features, latent variables, and training methods that port well across languages and string-transduction tasks. We would like to use features that look at wide context on the input side, which is inexpensive (Jiampojamarn et al., 2007). Latent variables we wish to consider are an increased number of word classes; more flexible regions—see Petrov et al. (2007) on learning a state transition diagram for acoustic regions in phone recognition—and phonological features and syllable boundaries. Indeed, our local log-linear features over several aligned latent strings closely resemble the soft constraints used by phonologists (Eisner, 1997). Finally, rather than define a fixed set of feature templates as in Fig. 2, we would like to refine empirically useful features during training, resulting in language-specific backoff patterns and adaptively sized n-gram windows. Many of these enhancements will increase the computational burden, and we are interested ","@endWordPosition":"6427","@position":"38100","annotationId":"T2","@startWordPosition":"6424","@citStr":"Petrov et al. (2007)"}},"title":{"#tail":"\n","#text":"Learning structured models for phone recognition."},"booktitle":{"#tail":"\n","#text":"In Proc. of EMNLP-CoNLL."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Slav Petrov"},{"#tail":"\n","#text":"Adam Pauls"},{"#tail":"\n","#text":"Dan Klein"}]}}]}}}}
