{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"volume":{"#tail":"\n","#text":"29"},"#tail":"\n","date":{"#tail":"\n","#text":"2003"},"rawString":{"#tail":"\n","#text":"Mirella Lapata and Alex Lascarides. 2003. A Probabilistic Account of Logical Metonymy. Computational Linguistics, 29(2):261–316."},"journal":{"#tail":"\n","#text":"Computational Linguistics,"},"#text":"\n","issue":{"#tail":"\n","#text":"2"},"marker":{"#tail":"\n","#text":"Lapata, Lascarides, 2003"},"contexts":{"#tail":"\n","#text":"\n","context":[{"#tail":"\n","#text":", at present there exists no corresponding lexical semantic resource. Several approaches have been presented that aim at creating a knowledge base containing noun-verb relations. There are two main research paradigms for developing such knowledge bases. The first paradigm assumes manual development of the resource (Pustejovsky et al., 2006), while the second one relies on automatic acquisition methods, see for example (Cimiano and Wenderoth, 2007). In this paper we propose a procedure for automatic acquisition of argument-predicate relations from a semantically annotated corpus. In line with (Lapata and Lascarides, 2003) our approach is based on the assumption that predicates are omitted in a discourse when they are highly predictable from the semantics of their arguments. We exploit SALSA (Burchardt et al., 2006), a German newspaper corpus manually annotated with FrameNet frames based on frame semantics. Using a manually annotated corpus for relation extraction has one particular advantage compared to extraction from plain text: the type of an argument-predicate relation is already annotated; there is no need to determine it by automatic means which are usually error-prone. However, the relatively small size","@endWordPosition":"404","@position":"2745","annotationId":"T1","@startWordPosition":"401","@citStr":"Lapata and Lascarides, 2003"},{"#tail":"\n","#text":"lia structures from a partially parsed corpus. Cimiano and Wenderoth (2007) suggest a pattern-based method for automatic extraction of qualia structures from the Web. The results of the human judgment experiment reported in (Cimiano and Wenderoth, 2007) suggest that the automatic acquisition of qualia structures is a difficult task. Human test subjects have shown a very low agreement (11,8% average agreement) in providing qualia structures for given nouns. Another line of research on inferring implicit predicates concerns using information about collocations derived from corpora. For example, Lapata and Lascarides (2003) resolve logical metonymy on the basis of the distribution of paraphrases like finish the cigarette – finish smoking the cigarette and easy problem – problem which is easy to solve in a corpus. This approach shows promising results, but it is limited to logical metonymy. Similarly, Nastase et al. (2006) use grammatical collocations for defining semantic relations between constituents in noun compounds. In our study we aim at extracting intuitively plausible argument-predicate relations from a semantically annotated corpus. Using an annotated corpus we avoid problems of defining types of these ","@endWordPosition":"1464","@position":"9361","annotationId":"T2","@startWordPosition":"1461","@citStr":"Lapata and Lascarides (2003)"},{"#tail":"\n","#text":" relatedness. The SALSA corpus, comprising less than 1 million tokens, is too small for this purpose. Moreover, a considerable number of predicates in SALSA appeared to be unannotated. Some of the high frequency pairs, as for example Bombe, explodieren ’bomb, to explode’, occur in SALSA only once, just as occasional pairs like Deutsche, entdecken ’German, to discover’. We have tried to overcome the size problems by using a larger unannotated corpus for recomputing the rating of our resulting relations, see next section. 5 Automatic Acquisition of the Argument-Predicate Relations In line with (Lapata and Lascarides, 2003), our approach to extraction of argument-predicate (AP) relations is based on two assumptions: A1: If predicates are highly predictable from the semantics of their arguments then they can be omitted in a discourse; A2: If a predicate frequently takes a word as an argument then it is highly predictable from the semantics of this word. In the proposed experimental setting argumentpredicate relations are defined in terms of the FrameNet frames. Thus, we aim at extracting from SALSA tuples of the form (Argument, ROLE, FRAME, Predicate) such that the Argument plausibly fills the ROLE in the FRAME e","@endWordPosition":"2168","@position":"13824","annotationId":"T3","@startWordPosition":"2165","@citStr":"Lapata and Lascarides, 2003"},{"#tail":"\n","#text":" extend phrases containing implicit predicates. In the future we plan to implement a procedure making use of the extracted AP-relations which would automatically extend phrases containing implicit predicates. Then we intend to compare output results of the procedure with the human responses. Additionally, a study of a possible correspondence between human agreement on associated predicates and a semantic type of an argument (e.g. concrete/abstract, natural kind/artifact) should be performed on more test arguments. Potential Applications As already mentioned in the literature, see for example (Lapata and Lascarides, 2003), knowledge about implicit predicates could be potentially useful for a variety of NLP tasks such as language generation, information extraction, question answering or machine translation. Many applications of semantic relations in NLP are connected to paraphrasing or query expansion, see for example (Voorhees, 1994). Suppose that a search engine or a question answering system receives the query schnelle Bombe ’quick bomb’. Probably, in this case the user is interested in finding information about bombs that explode quickly rather then about bombs in general. Knowledge about predicates associa","@endWordPosition":"5810","@position":"36635","annotationId":"T4","@startWordPosition":"5807","@citStr":"Lapata and Lascarides, 2003"}]},"title":{"#tail":"\n","#text":"A Probabilistic Account of Logical Metonymy."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Mirella Lapata"},{"#tail":"\n","#text":"Alex Lascarides"}]}}}}}}
