{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"2008"},"rawString":{"#tail":"\n","#text":"Kuzman Ganchev and Mark Dredze. 2008. Small statistical models by random feature mixing. In Proc. ACL 2008 Workshop on Mobile Language Processing, pages 19–20."},"#text":"\n","pages":{"#tail":"\n","#text":"pages"},"marker":{"#tail":"\n","#text":"Ganchev, Dredze, 2008"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"n of the fstrie required to achieve the same speed-up. The implementations of the proposed algorithm for LLMs and SVMs (with a polynomial kernel) and the Japanese dependency parser will be available at http://www.tkl.iis.u-tokyo.ac.jp/˜ynaga/. We plan to apply our method to wider range of classifiers used in various NLP tasks. To speed up classifiers used in a real-time application, we can build fstries incrementally by using feature vectors generated from user inputs. When we run our classifiers on resource-tight environments such as cell-phones, we can use a random feature mixing technique (Ganchev and Dredze, 2008) or a memory-efficient trie implementation based on a succinct data structure (Jacobson, 1989; Delpratt et al., 2006) to reduce required memory usage. We will combine our method with other techniques that provide sparse solutions, for example, kernel methods on a budget (Dekel and Singer, 2007; Dekel et al., 2008; Orabona et al., 2008) or kernel approximation (surveyed in Kashima et al. (2009)). It is also easy to combine our method with SVMs with partial kernel expansion (Goldberg and Elhadad, 2008), which will yield slower but more space-efficient classifiers. We will in the future consider ","@endWordPosition":"6019","@position":"35486","annotationId":"T1","@startWordPosition":"6016","@citStr":"Ganchev and Dredze, 2008"}},"title":{"#tail":"\n","#text":"Small statistical models by random feature mixing."},"booktitle":{"#tail":"\n","#text":"In Proc. ACL 2008 Workshop on Mobile Language Processing,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Kuzman Ganchev"},{"#tail":"\n","#text":"Mark Dredze"}]}}}}}}
