{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"2008"},"rawString":{"#tail":"\n","#text":"S. Schoenmackers, O. Etzioni, and D. Weld. 2008. Scaling textual inference to the web. In Proceedings of the 2008 Conference on Empirical Methods in Natural Language Processing (EMNLP)."},"#text":"\n","marker":{"#tail":"\n","#text":"Schoenmackers, Etzioni, Weld, 2008"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"n important sub-component of identifying a functional relation phrase is identifying typed functionality, i.e., functionality when the arguments of the relation phrase are type-constrained. Because CLEANLISTS is able to use typed lists, it can successfully identify typed functionality. We run our techniques on a large set of relations to output a first repository of typed functional relations. We release this list for further use by the research community.2 Future Work: Functionality is one of the several properties a relation can possess. Others include selectional preferences, transitivity (Schoenmackers et al., 2008), mutual exclusion, symmetry, etc. These properties are very useful in increasing our understanding about these Open IE relation strings. We believe that the general principles developed in this work, for example, connecting the Open IE knowledge with an existing knowledge resource, will come in very handy in identifying these other properties. Acknowledgements We would like to thank Alan Ritter, Alex Yates and Anthony Fader for access to their data sets. We would like to thank Stephen Soderland, Yoav Artzi, and the anonymous reviewers for helpful comments on previous drafts. This research was","@endWordPosition":"6239","@position":"39213","annotationId":"T1","@startWordPosition":"6235","@citStr":"Schoenmackers et al., 2008"}},"title":{"#tail":"\n","#text":"Scaling textual inference to the web."},"booktitle":{"#tail":"\n","#text":"In Proceedings of the 2008 Conference on Empirical Methods in Natural Language Processing (EMNLP)."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"S Schoenmackers"},{"#tail":"\n","#text":"O Etzioni"},{"#tail":"\n","#text":"D Weld"}]}}}}}}
