{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":[{"date":{"#tail":"\n","#text":"2012"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"ith all subsets of TopSh and TopShvar; the best results were obtained using all features in each set. 7 Related Work Studies in sociolinguistics (e.g., (Ng et al., 1993; Ng et al., 1995; Reid and Ng, 2000)) have long established that dialog structure in interactions relates to power and influence. Researchers in the NLP community have studied power and influence in various genres of interactions, such as organizational email threads (Bramsen et al., 2011; Gilbert, 2012; Prabhakaran and Rambow, 2013; Prabhakaran and Rambow, 2014), online discussion forums (Danescu-Niculescu-Mizil et al., 2012; Biran et al., 2012) and online chat dialogs (Strzalkowski et al., 2012). The correlates analyzed in these studies range from word and phrase patterns, to derivatives of such patterns such as linguistic coordination, to deeper dialogic features such as argumentation and dialog acts. Our work differs from these studies in that we study the correlates of power in topic dynamics. Furthermore, we analyze spoken interactions. 8 Conclusion In this paper, we studied how topic shift patterns in the 2012 Republican presidential debates correlate with the power of candidates. We proposed an alternate formulation of the SIT","@endWordPosition":"2994","@position":"18115","annotationId":"T1","@startWordPosition":"2990","@citStr":"Biran et al., 2012"}},"title":{"#tail":"\n","#text":"Detecting influencers in written online conversations."},"#tail":"\n","institution":{"#tail":"\n","#text":"for Computational Linguistics."},"rawString":{"#tail":"\n","#text":"Or Biran, Sara Rosenthal, Jacob Andreas, Kathleen McKeown, and Owen Rambow. 2012. Detecting influencers in written online conversations. In Proceedings of the Second Workshop on Language in Social Media, pages 37–45, Montr´eal, Canada, June. Association for Computational Linguistics."},"#text":"\n","pages":{"#tail":"\n","#text":"37--45"},"marker":{"#tail":"\n","#text":"Biran, Rosenthal, Andreas, McKeown, Rambow, 2012"},"publisher":{"#tail":"\n","#text":"Association"},"location":{"#tail":"\n","#text":"Montr´eal, Canada,"},"booktitle":{"#tail":"\n","#text":"In Proceedings of the Second Workshop on Language in Social Media,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Or Biran"},{"#tail":"\n","#text":"Sara Rosenthal"},{"#tail":"\n","#text":"Jacob Andreas"},{"#tail":"\n","#text":"Kathleen McKeown"},{"#tail":"\n","#text":"Owen Rambow"}]}},{"date":{"#tail":"\n","#text":"2011"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"937. These results demonstrates the utility of topic shift features in the power ranking problem, especially using the SITSvar formulation. We also experimented with all subsets of TopSh and TopShvar; the best results were obtained using all features in each set. 7 Related Work Studies in sociolinguistics (e.g., (Ng et al., 1993; Ng et al., 1995; Reid and Ng, 2000)) have long established that dialog structure in interactions relates to power and influence. Researchers in the NLP community have studied power and influence in various genres of interactions, such as organizational email threads (Bramsen et al., 2011; Gilbert, 2012; Prabhakaran and Rambow, 2013; Prabhakaran and Rambow, 2014), online discussion forums (Danescu-Niculescu-Mizil et al., 2012; Biran et al., 2012) and online chat dialogs (Strzalkowski et al., 2012). The correlates analyzed in these studies range from word and phrase patterns, to derivatives of such patterns such as linguistic coordination, to deeper dialogic features such as argumentation and dialog acts. Our work differs from these studies in that we study the correlates of power in topic dynamics. Furthermore, we analyze spoken interactions. 8 Conclusion In this paper, we stu","@endWordPosition":"2970","@position":"17954","annotationId":"T2","@startWordPosition":"2967","@citStr":"Bramsen et al., 2011"}},"title":{"#tail":"\n","#text":"Extracting social power relationships from natural language."},"#tail":"\n","institution":{"#tail":"\n","#text":"for Computational Linguistics."},"rawString":{"#tail":"\n","#text":"Philip Bramsen, Martha Escobar-Molano, Ami Patel, and Rafael Alonso. 2011. Extracting social power relationships from natural language. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies, pages 773–782, Portland, Oregon, USA, June. Association for Computational Linguistics."},"#text":"\n","pages":{"#tail":"\n","#text":"773--782"},"marker":{"#tail":"\n","#text":"Bramsen, Escobar-Molano, Patel, Alonso, 2011"},"publisher":{"#tail":"\n","#text":"Association"},"location":{"#tail":"\n","#text":"Portland, Oregon, USA,"},"booktitle":{"#tail":"\n","#text":"In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Philip Bramsen"},{"#tail":"\n","#text":"Martha Escobar-Molano"},{"#tail":"\n","#text":"Ami Patel"},{"#tail":"\n","#text":"Rafael Alonso"}]}},{"date":{"#tail":"\n","#text":"2014"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":" in the power ranking problem, especially using the SITSvar formulation. We also experimented with all subsets of TopSh and TopShvar; the best results were obtained using all features in each set. 7 Related Work Studies in sociolinguistics (e.g., (Ng et al., 1993; Ng et al., 1995; Reid and Ng, 2000)) have long established that dialog structure in interactions relates to power and influence. Researchers in the NLP community have studied power and influence in various genres of interactions, such as organizational email threads (Bramsen et al., 2011; Gilbert, 2012; Prabhakaran and Rambow, 2013; Prabhakaran and Rambow, 2014), online discussion forums (Danescu-Niculescu-Mizil et al., 2012; Biran et al., 2012) and online chat dialogs (Strzalkowski et al., 2012). The correlates analyzed in these studies range from word and phrase patterns, to derivatives of such patterns such as linguistic coordination, to deeper dialogic features such as argumentation and dialog acts. Our work differs from these studies in that we study the correlates of power in topic dynamics. Furthermore, we analyze spoken interactions. 8 Conclusion In this paper, we studied how topic shift patterns in the 2012 Republican presidential debates co","@endWordPosition":"2981","@position":"18030","annotationId":"T3","@startWordPosition":"2977","@citStr":"Prabhakaran and Rambow, 2014"}},"title":{"#tail":"\n","#text":"Predicting power relations between participants in written dialog from a single thread."},"#tail":"\n","institution":{"#tail":"\n","#text":"for Computational Linguistics."},"rawString":{"#tail":"\n","#text":"Vinodkumar Prabhakaran and Owen Rambow. 2014. Predicting power relations between participants in written dialog from a single thread. In Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), pages 339–344, Baltimore, Maryland, June. Association for Computational Linguistics."},"#text":"\n","pages":{"#tail":"\n","#text":"339--344"},"marker":{"#tail":"\n","#text":"Prabhakaran, Rambow, 2014"},"publisher":{"#tail":"\n","#text":"Association"},"location":{"#tail":"\n","#text":"Baltimore, Maryland,"},"booktitle":{"#tail":"\n","#text":"In Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers),"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Vinodkumar Prabhakaran"},{"#tail":"\n","#text":"Owen Rambow"}]}},{"date":{"#tail":"\n","#text":"2014"},"contexts":{"#tail":"\n","#text":"\n","context":[{"#tail":"\n","#text":" and interruption patterns). Another finding was that the candidates’ power correlates with the distribution of topics they speak about in the debates: candidates with more power spoke significantly more about certain topics (e.g., economy) and less about certain other topics (e.g., energy). However, these findings relate to the specific election cycle that was analyzed and will not carry over to political debates in general. A further dimension with relevance beyond a specific election campaign is how topics evolve during the course of an interaction (e.g., who attempts to shift topics). In (Prabhakaran et al., 2014), we explored this dimension and found that candidates with higher power introduce significantly more topics in the debates, but attempt to shift topics significantly less often while responding to a moderator. We used the basic LDA topic modeling method (with a filter for substantivity of turns) to assign topics to turns, which were then used to detect shifts in topics. However, segmenting interactions into coherent topic segments is an active area of research and a variety of topic modeling approaches have been proposed for that purpose. In this paper, we explore the utility of one such topi","@endWordPosition":"498","@position":"3181","annotationId":"T4","@startWordPosition":"495","@citStr":"Prabhakaran et al., 2014"},{"#tail":"\n","#text":"persona”, we find that the topic shifting tendency of a candidate does indeed show a great deal of fluctuation during the election campaign period. We also find that this fluctuation in topic shifting tendencies is significantly correlated with the candidates’ power. As an additional contribution of this paper, we demonstrate the utility of our topic shift features extracted using both types of SITS-based analyses in improving the performance of the automatic power ranker system presented in (Prabhakaran et al., 2013b). We also investigated the utility of topic shifting features described in (Prabhakaran et al., 2014) extracted using LDA based topic modeling. However, they did not improve the performance of the ranker, and hence we do not discuss them in detail in this paper. 3 Data We use the presidential debates corpus released by Prabhakaran et al. (2013a), which contains manual transcripts of 20 debates held between May 2011 and February 2012 as part of the 2012 Republican presidential primaries. The corpus also captures each candidate’s power at the time of each debate, computed based on their relative standing in recent public polls. The poll numbers capture how successful candidates are in convincin","@endWordPosition":"964","@position":"6027","annotationId":"T5","@startWordPosition":"960","@citStr":"Prabhakaran et al., 2014"},{"#tail":"\n","#text":"res obtained from the SITSvar run as TopShvar. Table 1 shows the Pearson’s product correlation between each topical feature and candidate’s power. We obtain a highly significant (p = 0.002) negative correlation between topic shift tendency of a candidate (PI) and his/her power. In other words, the variation in the topic shifting tendencies is significantly correlated with the candidates’ recent poll standings. Candidates who are higher up in the polls tend to stay on topic while the candidates with less power attempt to shift topics more often. This is in line with our previous findings from (Prabhakaran et al., 2014) that candidates with higher power attempt to shift topics less often than others when responding to moderators. It is also in line with the findings by Prabhakaran et al. (2013a) that candidates with higher power tend not to interrupt others. On the other hand, we did not obtain any significant correlation for the features proposed by Nguyen et al. (2013). 6 Topic Shift Features in Power Ranker In this section, we investigate the utility of the SITS and SITSvar based topic shift features described above in the problem of automatically ranking the participants of debates based on their power. ","@endWordPosition":"2299","@position":"14047","annotationId":"T6","@startWordPosition":"2296","@citStr":"Prabhakaran et al., 2014"}]},"title":{"#tail":"\n","#text":"Power of confidence: How poll scores impact topic dynamics in political debates."},"#tail":"\n","institution":{"#tail":"\n","#text":"for Computational Linguistics."},"rawString":{"#tail":"\n","#text":"Vinodkumar Prabhakaran, Ashima Arora, and Owen Rambow. 2014. Power of confidence: How poll scores impact topic dynamics in political debates. In Proceedings of the ACL 2014 Workshop on Language Technologies and Computational Social Science, page 49, Baltimore, MD, USA, June. Association for Computational Linguistics."},"#text":"\n","marker":{"#tail":"\n","#text":"Prabhakaran, Arora, Rambow, 2014"},"publisher":{"#tail":"\n","#text":"Association"},"location":{"#tail":"\n","#text":"Baltimore, MD, USA,"},"booktitle":{"#tail":"\n","#text":"In Proceedings of the ACL 2014 Workshop on Language Technologies and Computational Social Science, page 49,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Vinodkumar Prabhakaran"},{"#tail":"\n","#text":"Ashima Arora"},{"#tail":"\n","#text":"Owen Rambow"}]}},{"date":{"#tail":"\n","#text":"2013"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"andidates’ relative rankings. 1 Introduction The field of computational social sciences has created many interesting applications for natural language processing in recent years. One of the areas where NLP techniques have shown great promise is in the analysis of political speech. For example, researchers have applied NLP techniques to political texts for a variety of tasks such as predicting voting patterns (Thomas et al., 2006), identifying markers of persuasion (Guerini et al., 2008), capturing cues that signal charisma (Rosenberg and Hirschberg, 2009), and detecting ideological positions (Sim et al., 2013). Our work also analyzes political speech, more specifically, presidential debates. The contribution of this paper is to show that the topic shifting tendency of a presidential candidate changes over the course of the election campaign, and that it is correlated with his or her relative power. We also show that this insight can help computational systems that predict the candidates’ relative rankings based on their interactions in the debates. 2 Motivation The motivation for this paper stems from prior work done by the first author in collaboration with other researchers (Prabhakaran et al., 2","@endWordPosition":"198","@position":"1318","annotationId":"T7","@startWordPosition":"195","@citStr":"Sim et al., 2013"}},"title":{"#tail":"\n","#text":"Measuring ideological proportions in political speeches."},"#tail":"\n","institution":{"#tail":"\n","#text":"for Computational Linguistics."},"rawString":{"#tail":"\n","#text":"Yanchuan Sim, Brice D. L. Acree, Justin H. Gross, and Noah A. Smith. 2013. Measuring ideological proportions in political speeches. In Proceedings of the 2013 Conference on EMNLP, pages 91–101, Seattle, Washington, USA, October. Association for Computational Linguistics."},"#text":"\n","pages":{"#tail":"\n","#text":"91--101"},"marker":{"#tail":"\n","#text":"Sim, Acree, Gross, Smith, 2013"},"publisher":{"#tail":"\n","#text":"Association"},"location":{"#tail":"\n","#text":"Seattle, Washington, USA,"},"booktitle":{"#tail":"\n","#text":"In Proceedings of the 2013 Conference on EMNLP,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Yanchuan Sim"},{"#tail":"\n","#text":"Brice D L Acree"},{"#tail":"\n","#text":"Justin H Gross"},{"#tail":"\n","#text":"Noah A Smith"}]}},{"date":{"#tail":"\n","#text":"2006"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"candidates to shift topics changes over the course of the election campaign, and that it is correlated with their relative power. We also show that our topic shift features help predict candidates’ relative rankings. 1 Introduction The field of computational social sciences has created many interesting applications for natural language processing in recent years. One of the areas where NLP techniques have shown great promise is in the analysis of political speech. For example, researchers have applied NLP techniques to political texts for a variety of tasks such as predicting voting patterns (Thomas et al., 2006), identifying markers of persuasion (Guerini et al., 2008), capturing cues that signal charisma (Rosenberg and Hirschberg, 2009), and detecting ideological positions (Sim et al., 2013). Our work also analyzes political speech, more specifically, presidential debates. The contribution of this paper is to show that the topic shifting tendency of a presidential candidate changes over the course of the election campaign, and that it is correlated with his or her relative power. We also show that this insight can help computational systems that predict the candidates’ relative rankings based on the","@endWordPosition":"171","@position":"1134","annotationId":"T8","@startWordPosition":"168","@citStr":"Thomas et al., 2006"}},"title":{"#tail":"\n","#text":"Get out the vote: Determining support or opposition from congressional floor-debate transcripts."},"#tail":"\n","institution":{"#tail":"\n","#text":"for Computational Linguistics."},"rawString":{"#tail":"\n","#text":"Matt Thomas, Bo Pang, and Lillian Lee. 2006. Get out the vote: Determining support or opposition from congressional floor-debate transcripts. In Proceedings of the 2006 Conference on Empirical Methods in Natural Language Processing, pages 327–335, Sydney, Australia, July. Association for Computational Linguistics."},"#text":"\n","pages":{"#tail":"\n","#text":"327--335"},"marker":{"#tail":"\n","#text":"Thomas, Pang, Lee, 2006"},"publisher":{"#tail":"\n","#text":"Association"},"location":{"#tail":"\n","#text":"Sydney, Australia,"},"booktitle":{"#tail":"\n","#text":"In Proceedings of the 2006 Conference on Empirical Methods in Natural Language Processing,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Matt Thomas"},{"#tail":"\n","#text":"Bo Pang"},{"#tail":"\n","#text":"Lillian Lee"}]}}]}}}}
