{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"1990"},"rawString":{"#tail":"\n","#text":"Bateman, John A. 1990. Upper modeling: Organizing knowledge for natural language processing. In Proceedings of the Fifth International Workshop on Natural Language Generation, Pittsburgh, PA."},"#text":"\n","marker":{"#tail":"\n","#text":"Bateman, 1990"},"location":{"#tail":"\n","#text":"Pittsburgh, PA."},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"nd speculates on a few directions for future research. At first I found Chapters 4 through 8 slightly overwhelming, as they introduce several levels of representation, each with its own terminology and acronyms. However, at a second, more-careful, reading, everything falls into place. The resulting approach has at its center a lexicon that partly implements current theories of lexical semantics such as Jackendoff's (1990) and Levin's (1993). The lexicon is used to mediate and map between a language-independent domain model and a language-dependent ontology widely used in NLG, the Upper Model (Bateman 1990). Although the idea of a two-level representation accommodating language-neutral and language-specific requirements is not new (see for example Nirenburg and Levin [1992], Dorr and Voss [1993], and Di Eugenio [1998]), Stede is among the few who make effective use of those two levels in a complex system. Chapter 4 presents the domain model built by means of the description logic system LOOM (MacGregor and Burstein 1991). Stede is specifically interested in verbalizations of situations, to use his own neutral term. Thus, the domain model contains a representation for categories such as states, a","@endWordPosition":"574","@position":"3729","annotationId":"T1","@startWordPosition":"573","@citStr":"Bateman 1990"}},"title":{"#tail":"\n","#text":"Upper modeling: Organizing knowledge for natural language processing."},"booktitle":{"#tail":"\n","#text":"In Proceedings of the Fifth International Workshop on Natural Language Generation,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":{"#tail":"\n","#text":"John A Bateman"}}}}}}}
