{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":[{"#tail":"\n","date":{"#tail":"\n","#text":"1987"},"rawString":{"#tail":"\n","#text":"Danlos, Laurence. 1987. The Linguistic Basis of Text Generation. Cambridge University Press, Cambridge, UK."},"#text":"\n","marker":{"#tail":"\n","#text":"Danlos, 1987"},"publisher":{"#tail":"\n","#text":"Cambridge University Press,"},"location":{"#tail":"\n","#text":"Cambridge, UK."},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"minalization decisions are typically made earlier than word-ordering decisions; for example in the three-stage pipelined architecture presented by Reiter and Dale (2000), pronominalization decisions are made in the second stage (microplanning), but word ordering is chosen during the third stage (realization). This means that the microplanner will not be able to make optimal pronominalization decisions in cases where le or la are unambiguous, but l' is not, since it does not know word order and hence whether the pronoun will be abbreviated. Many other such cases are described in Danlos's book (Danlos 1987). The common theme behind many of these examples is that pipelines have difficulties satisfying linguistic constraints (such as unambiguous reference) or performing linguistic optimizations (such as using pronouns instead of longer referring expressions whenever possible) in cases where the constraints or optimizations depend on decisions made in multiple modules. This is largely due to the fact that pipelined systems cannot perform general search over a decision space that includes decisions made in more than one module. Despite these arguments, most applied NLG systems use a pipelined archit","@endWordPosition":"829","@position":"5203","annotationId":"T1","@startWordPosition":"828","@citStr":"Danlos 1987"}},"title":{"#tail":"\n","#text":"The Linguistic Basis of Text Generation."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":{"#tail":"\n","#text":"Laurence Danlos"}}},{"#tail":"\n","date":{"#tail":"\n","#text":"1998"},"rawString":{"#tail":"\n","#text":"Mittal, Vibhu, Johanna Moore, Guiseppe Carenini, and Steven Roth. 1998. Describing complex charts in natural language: A caption generation system. Computational Linguistics, 24:431-467."},"journal":{"#tail":"\n","#text":"Computational Linguistics,"},"#text":"\n","pages":{"#tail":"\n","#text":"24--431"},"marker":{"#tail":"\n","#text":"Mittal, Moore, Carenini, Roth, 1998"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"end on decisions made in multiple modules. This is largely due to the fact that pipelined systems cannot perform general search over a decision space that includes decisions made in more than one module. Despite these arguments, most applied NLG systems use a pipelined architecture; indeed, a pipeline was used in every one of the systems surveyed by Reiter (1994) and Paiva (1998). This may be because pipelines have many engineering advantages, and in practice the sort of problems pointed out by Danlos and other pipeline critics do not seem to be a major problem in current applied NLG systems (Mittal et al. 1998). 3. STOP The STOP system (Reiter, Robertson, and Osman 1999) generates personalized smokingcessation leaflets, based on responses to a questionnaire about smoking likes and dislikes, previous attempts to quit, and so forth. The output of the system is a four-page leaflet; each page is size A5. An example of the two &quot;inside&quot; pages of a leaflet produced by STOP is shown in Figure 1. A STOP leaflet also contains a front page that is only partially generated (the rest is logos and fixed text) and a back page that is selected from a collection of 16 possible back pages, but is not otherwise person","@endWordPosition":"978","@position":"6146","annotationId":"T2","@startWordPosition":"975","@citStr":"Mittal et al. 1998"}},"title":{"#tail":"\n","#text":"Describing complex charts in natural language: A caption generation system."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Vibhu Mittal"},{"#tail":"\n","#text":"Johanna Moore"},{"#tail":"\n","#text":"Guiseppe Carenini"},{"#tail":"\n","#text":"Steven Roth"}]}},{"#tail":"\n","date":{"#tail":"\n","#text":"1994"},"rawString":{"#tail":"\n","#text":"Reiter, Ehud. 1994. Has a consensus NL generation architecture appeared, and is it psycholinguistically plausible? In Proceedings of the Seventh International Workshop on Natural Language Generation (INLGW-1994), pages 163-170."},"#text":"\n","pages":{"#tail":"\n","#text":"163--170"},"marker":{"#tail":"\n","#text":"Reiter, 1994"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"iculties satisfying linguistic constraints (such as unambiguous reference) or performing linguistic optimizations (such as using pronouns instead of longer referring expressions whenever possible) in cases where the constraints or optimizations depend on decisions made in multiple modules. This is largely due to the fact that pipelined systems cannot perform general search over a decision space that includes decisions made in more than one module. Despite these arguments, most applied NLG systems use a pipelined architecture; indeed, a pipeline was used in every one of the systems surveyed by Reiter (1994) and Paiva (1998). This may be because pipelines have many engineering advantages, and in practice the sort of problems pointed out by Danlos and other pipeline critics do not seem to be a major problem in current applied NLG systems (Mittal et al. 1998). 3. STOP The STOP system (Reiter, Robertson, and Osman 1999) generates personalized smokingcessation leaflets, based on responses to a questionnaire about smoking likes and dislikes, previous attempts to quit, and so forth. The output of the system is a four-page leaflet; each page is size A5. An example of the two &quot;inside&quot; pages of a leaflet ","@endWordPosition":"934","@position":"5892","annotationId":"T3","@startWordPosition":"933","@citStr":"Reiter (1994)"}},"title":{"#tail":"\n","#text":"Has a consensus NL generation architecture appeared, and is it psycholinguistically plausible?"},"booktitle":{"#tail":"\n","#text":"In Proceedings of the Seventh International Workshop on Natural Language Generation (INLGW-1994),"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":{"#tail":"\n","#text":"Ehud Reiter"}}}]}}}}
