{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"1991"},"rawString":{"#tail":"\n","#text":"Radzinsky, Daniel. 1991. Chinese number-names, tree adjoining languages, and mild context-sensitivity. Computational Linguistics, 17(3):277-299."},"journal":{"#tail":"\n","#text":"Computational Linguistics,"},"#text":"\n","pages":{"#tail":"\n","#text":"17--3"},"marker":{"#tail":"\n","#text":"Radzinsky, 1991"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"nfinite series of long-enough sentences that parse in time x by this grammar. However, what matters in engineering practice is the average case for a specific grammar. Specific, since a specific grammar belonging to a high complexity class may well prove to parse much faster than the worst grammar of its class, even with the general algorithm, if the possible time-consuming behavior of the algorithm never happens for this grammar. Average, since it can happen that the grammar does admit hard-toparse sentences that are not used (or at least not frequently used) in the real corpus. For example, Radzinsky (1991) proves that Chinese numerals such as wu zhao zhao zhao zhao zhao wu zhao zhao zhao zhao wu zhao zhao zhao wu zhao zhao wu zhao, for the number 5000000000000000005000000000000005000000000005000000005000, are not context-free, which implies that Chinese is not a context-free language and thus might parse in exponential worst-case time. Do such arguments—no doubt important for mathematical linguistics—have any direct consequences for an engineering linguistics? Even if a Chinese grammar includes a non-context-free rule for parsing such numerals, how frequently will it be activated? Does it imply","@endWordPosition":"3523","@position":"21876","annotationId":"T1","@startWordPosition":"3522","@citStr":"Radzinsky (1991)"}},"title":{"#tail":"\n","#text":"Chinese number-names, tree adjoining languages, and mild context-sensitivity."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":{"#tail":"\n","#text":"Daniel Radzinsky"}}}}}}}
