{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"1994"},"rawString":{"#tail":"\n","#text":"Kaplan, Ronald M. and Martin Kay. 1994. Regular models of phonological rule systems. Computational Linguistics, 21(3):331-378."},"journal":{"#tail":"\n","#text":"Computational Linguistics,"},"#text":"\n","pages":{"#tail":"\n","#text":"21--3"},"marker":{"#tail":"\n","#text":"Kaplan, Kay, 1994"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"This system extracts relational information, such as &quot;who is where&quot; or &quot;who bought what&quot;, from issues of the Wall Street Journal (source code and sample data are included on the CD-ROM). Shortly after the publication of The Sound Pattern of English (Chomsky and Halle 1968), Kornai points out, &quot;Johnson (1970) demonstrated that the context-sensitive machinery of SPE . . . [could] be replaced by a much simpler one, based on finite-state transducers (FSTs); the same conclusion was reached independently by Kaplan and Kay, whose work remained an underground classic until it was finally published in Kaplan and Kay (1994).&quot; These works inspired Koskenniemi's two-level system, and the Xerox rule compiler (Dalrymple et al. 1987). Both are now dominant tools in the fields of computational phonology and morphology, as exemplified by Tateno et al. (Chapter 6), &quot;The Japanese lexical transducer based on stem-suffix style forms&quot; and Kim and Jang (Chapter 7), &quot;Acquiring rules for reducing morphological ambiguity from POS tagged corpus in Korean.&quot; The latter includes an algorithm for automatically inferring regular grammar rules for morphological relations directly from part-of-speech tagged corpora. Although finite-sta","@endWordPosition":"639","@position":"4077","annotationId":"T1","@startWordPosition":"635","@citStr":"Kaplan and Kay (1994)"}},"title":{"#tail":"\n","#text":"Regular models of phonological rule systems."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Ronald M Kaplan"},{"#tail":"\n","#text":"Martin Kay"}]}}}}}}
