{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":[{"volume":{"#tail":"\n","#text":"19"},"#tail":"\n","date":{"#tail":"\n","#text":"1993"},"rawString":{"#tail":"\n","#text":"Hindle, Donald and Mats Rooth. 1993. Structural ambiguity and lexical relations. Computational Linguistics, 19(1):103–120."},"journal":{"#tail":"\n","#text":"Computational Linguistics,"},"#text":"\n","issue":{"#tail":"\n","#text":"1"},"marker":{"#tail":"\n","#text":"Hindle, Rooth, 1993"},"contexts":{"#tail":"\n","#text":"\n","context":[{"#tail":"\n","#text":"r interpretation of constituents in the sentence. Consider the timeworn example (1) I saw the man with the telescope. It is important to determine if the PP with the telescope is to be attached as a sister to the noun the man, restricting its interpretation, or if it is to be attached to the verb, thereby indicating the instrument of the main action described by the sentence. Based on examples of this sort, recent approaches have formalized the problem of disambiguating PP attachments as a binary choice, distinguishing between attachment of a PP to a given verb or to the verb’s direct object (Hindle and Rooth 1993; Ratnaparkhi, Reynar, and Roukos 1994; Collins and Brooks 1995; Merlo, Crocker, and Berthouzoz 1997; Stetina and Nagao 1997; Ratnaparkhi 1997; Zhao and Lin 2004). This is, however, a simplification of the problem, which does not take the nature of the attachment into account. Precisely, it does not distinguish PP arguments from * Linguistics Department, University of Geneva, 2 rue de Candolle, 1211 Gen`eve 4, Switzerland. † Department of Informatics, University of Sussex, Falmer, Brighton BN19QH, UK. Submission received: 28 November 2003; revised submission received: 22 June 2005; accepted fo","@endWordPosition":"332","@position":"2137","annotationId":"T1","@startWordPosition":"329","@citStr":"Hindle and Rooth 1993"},{"#tail":"\n","#text":"ent corpora. Framenet makes a distinction between complements and satellites (Baker, Fillmore, and Lowe 1998). The developers of PropBank integrate the difference between arguments and adjuncts directly into the level of specificity of their annotation. They adopt labels that are common across verbs for adjuncts. They inherit these labels from the Penn Treebank annotation. Arguments are annotated instead with labels specific to each verb (Xue 2004; Palmer, Gildea, and Kingsbury 2005). From a quantitative point of view, arguments and adjuncts have different statistical properties. For example, Hindle and Rooth (1993) clearly indicate that their lexical association technique performs much better for arguments than for adjuncts, whether the attachment is to the verb or to the noun. Researchers have abstracted away from this distinction, because identifying arguments and adjuncts is a notoriously difficult task, taxing many native speakers’ intuitions. The usual expectation has been that this discrimination is not amenable to a corpus-based treatment. In recent preliminary work, however, we have succeeded in distinguishing arguments from adjuncts using corpus evidence (Merlo and Leybold 2001; Merlo 2003). Ou","@endWordPosition":"1112","@position":"7017","annotationId":"T2","@startWordPosition":"1109","@citStr":"Hindle and Rooth (1993)"},{"#tail":"\n","#text":"ctic-semantic information, encoded indirectly in the diagnostics. All the combinations that are not shown here have lower accuracies. Table 3 shows the confusion matrix for the combination of features with the best accuracy listed above. These figures yield a precision and recall for arguments of 80% and 85%, respectively (F measure = 82%); and a precision and recall for adjuncts of 80% and 73%, respectively (F measure = 76%). Clearly, although both kinds of PPs are well identified, arguments are better identified than adjuncts, an observation already made by several other authors, especially Hindle and Rooth (1993) in their detailed discussion of the errors in a noun or verb PP-attachment task. In particular, we notice that more adjuncts are misclassified as arguments than vice versa. The results of these experiments confirm that corpus information is conducive to learning the distinction under discussion without explicitly represented complex semantic knowledge. They also confirm that this distinction is essentially a word class phenomenon—and not an individual lexical-item phenomenon—as would be expected under current theories of the syntax–semantics interface. Finally, the combination of lexical item","@endWordPosition":"10005","@position":"62260","annotationId":"T3","@startWordPosition":"10002","@citStr":"Hindle and Rooth (1993)"},{"#tail":"\n","#text":"they are not calculated on a previously unseen test set, the generability of the approach is not clear. Moreover, Villavicencio applies only one diagnostic test to determine if a PP is an argument or an adjunct, whereas our extensive validation study has shown that several tests are necessary to reach a reliable judgment. In a study about the automatic acquisition of lexical dependencies for lexicon building, Fabre and Bourigault (2001) discuss the relation of the problem of PP attachment and the notion of argument and adjunct. They correctly notice that approaches such as theirs, inspired by Hindle and Rooth (1993), are based on the assumption that high 371 Computational Linguistics Volume 32, Number 3 co-occurrence between words is an indication of a lexical argumenthood relation. As also noticed in Merlo and Leybold (2001), this is not always the case: some adjuncts frequently co-occur with certain heads too. Fabre and Bourigault propose a notion of productivity that strongly resembles our notions of optionality and head dependence to capture the two intuitions about the distribution of arguments and adjuncts. Arguments are strongly selected by the head (the head to complement relation is not producti","@endWordPosition":"15787","@position":"98593","annotationId":"T4","@startWordPosition":"15784","@citStr":"Hindle and Rooth (1993)"},{"#tail":"\n","#text":"hly productive). They propose, but do not test, the hypothesis that this notion might be useful for the general problem of PP attachment. The results in the current article show that this is not the case. In fact, we have argued that there is no real reason to believe that the two notions should be related, other than marginally. 6.2 On the Distinction of Argument from Adjunct PPs for Subcategorization Acquisition As far as we are aware, this is the first attempt to integrate the notion of argumenthood in a more comprehensive formulation of the problem of disambiguating the attachment of PPs. Hindle and Rooth (1993) mention the interaction between the structural and the semantic factors in the disambiguation of a PP, indicating that verb complements are the most difficult. We confirm their finding that noun arguments are more easily identified, whereas verb complements (either arguments or adjuncts) are more difficult. Other pieces of work address the current problem in the larger perspective of distinguishing arguments from adjuncts for subcategorization acquisition (Korhonen 2002a; Aldezabal et al. 2002). The goal of the work of Korhonen (2002a, 2002b) is to develop a semantically driven approach to su","@endWordPosition":"16002","@position":"99920","annotationId":"T5","@startWordPosition":"15999","@citStr":"Hindle and Rooth (1993)"}]},"title":{"#tail":"\n","#text":"Structural ambiguity and lexical relations."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Donald Hindle"},{"#tail":"\n","#text":"Mats Rooth"}]}},{"#tail":"\n","date":{"#tail":"\n","#text":"2002"},"rawString":{"#tail":"\n","#text":"Korhonen, Anna. 2002a. Semantically motivated subcategorization acquisition. In Proceedings of the Workshop of the ACL Special Interest Group on the Lexicon on Unsupervised Lexical Acquisition, pages 51–58, Philadelphia, PA, July."},"#text":"\n","pages":{"#tail":"\n","#text":"51--58"},"marker":{"#tail":"\n","#text":"Korhonen, 2002"},"location":{"#tail":"\n","#text":"Philadelphia, PA,"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"notion of argumenthood in a more comprehensive formulation of the problem of disambiguating the attachment of PPs. Hindle and Rooth (1993) mention the interaction between the structural and the semantic factors in the disambiguation of a PP, indicating that verb complements are the most difficult. We confirm their finding that noun arguments are more easily identified, whereas verb complements (either arguments or adjuncts) are more difficult. Other pieces of work address the current problem in the larger perspective of distinguishing arguments from adjuncts for subcategorization acquisition (Korhonen 2002a; Aldezabal et al. 2002). The goal of the work of Korhonen (2002a, 2002b) is to develop a semantically driven approach to subcategorization frame hypothesis selection that can be used to improve large-scale subcategorization frame acquisition. The main idea underlying the approach is to leverage the well-known mapping between syntax and semantics, inspired by Levin’s (1993) work. Korhonen uses statistics over semantic classes of verbs to smooth a distribution of subcategorization frames and then applies a simple frequency cutoff to select the most reliable subcategorization frames. Her work i","@endWordPosition":"16069","@position":"100395","annotationId":"T6","@startWordPosition":"16068","@citStr":"Korhonen 2002"}},"title":{"#tail":"\n","#text":"Semantically motivated subcategorization acquisition."},"booktitle":{"#tail":"\n","#text":"In Proceedings of the Workshop of the ACL Special Interest Group on the Lexicon on Unsupervised Lexical Acquisition,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":{"#tail":"\n","#text":"Anna Korhonen"}}},{"#tail":"\n","date":{"#tail":"\n","#text":"2001"},"rawString":{"#tail":"\n","#text":"Merlo, Paola and Matthias Leybold. 2001. Automatic distinction of arguments and modifiers: The case of prepositional phrases. In Proceedings of the Fifth Computational Natural Language Learning Workshop (CoNLL-2001), pages 121–128, Toulouse, France."},"#text":"\n","pages":{"#tail":"\n","#text":"121--128"},"marker":{"#tail":"\n","#text":"Merlo, Leybold, 2001"},"location":{"#tail":"\n","#text":"Toulouse, France."},"contexts":{"#tail":"\n","#text":"\n","context":[{"#tail":"\n","#text":"s. For example, Hindle and Rooth (1993) clearly indicate that their lexical association technique performs much better for arguments than for adjuncts, whether the attachment is to the verb or to the noun. Researchers have abstracted away from this distinction, because identifying arguments and adjuncts is a notoriously difficult task, taxing many native speakers’ intuitions. The usual expectation has been that this discrimination is not amenable to a corpus-based treatment. In recent preliminary work, however, we have succeeded in distinguishing arguments from adjuncts using corpus evidence (Merlo and Leybold 2001; Merlo 2003). Our method develops corpus-based statistical correlates for the diagnostics used in linguistics to decide whether a PP is an argument or an adjunct. A numerical vectorial representation of the notion of argumenthood is provided, which supports automatic classification. In the current article, we expand and improve on this work, by developing new measures and refining the previous ones. We also extend that work to attachment to nouns. This extension enables us to explore in what way the distinction between argument and adjunct is best integrated in the traditional attachment disa","@endWordPosition":"1196","@position":"7600","annotationId":"T7","@startWordPosition":"1193","@citStr":"Merlo and Leybold 2001"},{"#tail":"\n","#text":" preposition, and PP internal noun) indicating the two possible attachment sites and the most important words in the PP for each instance of PP attachments found in the corpus. We also create an auxiliary corpus of sequences of two PPs, where each data item consists of verb, direct object, and the two following PPs. This corpus is only used to estimate the feature Iterativity. All the data were extracted from the Penn Treebank using the tgrep tools (Marcus, Santorini, and Marcinkiewicz 1993). Our goal is to create a more comprehensive and possibly more accurate corpus than the corpora used by Merlo and Leybold (2001), Merlo, Crocker, and Berthouzoz (1997), and Collins and Brooks (1995), among others. To improve coverage, we extracted all cases of PPs following transitive and intransitive verbs and following nominal phrases. We include passive sentences and sentences containing a sentential object. To improve accuracy, we insured that we did not extract overlapping data, contrary to practice in previous PP corpora construction, where multiple PP sequences were extracted more than once, each time as part of a different structural configuration. For example, in previous corpora, the sequence using crocidolit","@endWordPosition":"4209","@position":"26685","annotationId":"T8","@startWordPosition":"4206","@citStr":"Merlo and Leybold (2001)"},{"#tail":"\n","#text":"rdNet class of h and n2, respectively. Let C(h, p, n2) be the frequency with which p, n2 co-occurs as a prepositional phrase with h. Let C(h) be the frequency of h. Head Dependence. Head dependence of a PP on a head is approximated by estimating the dispersion of the PP over the possible heads. In a previous attempt to capture this notion, we approximated by simply measuring the cardinality of the set of heads that co-occur with a given PP in a corpus, as indicated in equation (6). The expectation was that a low number indicated argument status, whereas a high number indicated adjunct status (Merlo and Leybold 2001). hdep(h, p, n2) _ |{h1, h2, h3, ... , hn}p,n2 |(6) By measuring the cardinality of the set of heads, we approximate the dispersion of the distribution of heads by its range. This is a very rough approximation, as the range of a distribution does not give any information on the distribution’s shape. The range of a distribution might have the same value for a uniform distribution or a very skewed distribution. Intuitively, we would like a measure that tells us that the former corresponds to a verb with a much lower head dependence than the latter. Entropy is 4 The automatic annotation of nouns ","@endWordPosition":"5383","@position":"33644","annotationId":"T9","@startWordPosition":"5380","@citStr":"Merlo and Leybold 2001"},{"#tail":"\n","#text":"f relatively little value in a real application. It would be more useful to know where the PP is attached and with what function. We review below the few pieces of work that have tackled the problem of labeling PPs by function (arguments or adjuncts) as a separate labeling problem. Other pieces of work have asked a similar question in the context of acquiring high-precision subcategorization frames. We review a few of them below. 6.1 On the Automatic Distinction of Arguments and Adjuncts A few other pieces of work attempt to distinguish PP arguments from adjuncts automatically (Buchholz 1999; Merlo and Leybold 2001; Villavicencio 2002). We extend and modify here the preliminary work reported in Merlo and Leybold (2001) by extending the method to noun attachment, elaborating more learning features, including cases specifically developed for noun attachment, refining all the counting methods, thus validating and extending the approach. The current work on automatic binary argument-adjunct classifiers appears to compare favorably to the only other study on this topic (Buchholz 1999). Buchholz (1999) reports an accuracy of 77% for the argument-adjunct distinction of PPs performed with a memory-based learnin","@endWordPosition":"15398","@position":"96063","annotationId":"T10","@startWordPosition":"15395","@citStr":"Merlo and Leybold 2001"},{"#tail":"\n","#text":"hereas our extensive validation study has shown that several tests are necessary to reach a reliable judgment. In a study about the automatic acquisition of lexical dependencies for lexicon building, Fabre and Bourigault (2001) discuss the relation of the problem of PP attachment and the notion of argument and adjunct. They correctly notice that approaches such as theirs, inspired by Hindle and Rooth (1993), are based on the assumption that high 371 Computational Linguistics Volume 32, Number 3 co-occurrence between words is an indication of a lexical argumenthood relation. As also noticed in Merlo and Leybold (2001), this is not always the case: some adjuncts frequently co-occur with certain heads too. Fabre and Bourigault propose a notion of productivity that strongly resembles our notions of optionality and head dependence to capture the two intuitions about the distribution of arguments and adjuncts. Arguments are strongly selected by the head (the head to complement relation is not productive), whereas adjuncts can be selected by a wide spread of heads (the complement to head selection is highly productive). They propose, but do not test, the hypothesis that this notion might be useful for the genera","@endWordPosition":"15820","@position":"98807","annotationId":"T11","@startWordPosition":"15817","@citStr":"Merlo and Leybold (2001)"}]},"title":{"#tail":"\n","#text":"Automatic distinction of arguments and modifiers: The case of prepositional phrases."},"booktitle":{"#tail":"\n","#text":"In Proceedings of the Fifth Computational Natural Language Learning Workshop (CoNLL-2001),"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Paola Merlo"},{"#tail":"\n","#text":"Matthias Leybold"}]}},{"volume":{"#tail":"\n","#text":"27"},"#tail":"\n","date":{"#tail":"\n","#text":"2001"},"rawString":{"#tail":"\n","#text":"Merlo, Paola and Suzanne Stevenson. 2001. Automatic verb classification based on statistical distributions of argument structure. Computational Linguistics, 27(3):373–408."},"journal":{"#tail":"\n","#text":"Computational Linguistics,"},"#text":"\n","issue":{"#tail":"\n","#text":"3"},"marker":{"#tail":"\n","#text":"Merlo, Stevenson, 2001"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"scale subcategorization frame acquisition. The main idea underlying the approach is to leverage the well-known mapping between syntax and semantics, inspired by Levin’s (1993) work. Korhonen uses statistics over semantic classes of verbs to smooth a distribution of subcategorization frames and then applies a simple frequency cutoff to select the most reliable subcategorization frames. Her work is related to ours in several ways. First, the automatic acquisition task leverages correspondences between syntax and semantics, particularly clear in the organization of the verb lexicon, similarly to Merlo and Stevenson (2001). Some of our current results are also based on this correspondence, as we assume that the notion of argument is a notion at the interface of the syntactic and semantic levels, and participates in both, determining not only the valency of a verb but also its subcategorization frame. Our work confirms the results reported in Korhonen (2002a), which indicate that using word classes improves the extraction of subcategorization frames. Differently from Korhonen, however, we do not allow feedback between levels. In her work, syntactic similarity of verbs’ subcategorization sets based on an external","@endWordPosition":"16189","@position":"101223","annotationId":"T12","@startWordPosition":"16186","@citStr":"Merlo and Stevenson (2001)"}},"title":{"#tail":"\n","#text":"Automatic verb classification based on statistical distributions of argument structure."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Paola Merlo"},{"#tail":"\n","#text":"Suzanne Stevenson"}]}},{"#tail":"\n","date":{"#tail":"\n","#text":"1997"},"rawString":{"#tail":"\n","#text":"Stetina, Jiri and Makoto Nagao. 1997. Corpus based PP attachment ambiguity resolution with a semantic dictionary. In Proceedings of the Fifth Workshop on Very Large Corpora, pages 66–80, Beijing/ Hong Kong."},"#text":"\n","pages":{"#tail":"\n","#text":"66--80"},"marker":{"#tail":"\n","#text":"Stetina, Nagao, 1997"},"location":{"#tail":"\n","#text":"Beijing/ Hong Kong."},"contexts":{"#tail":"\n","#text":"\n","context":[{"#tail":"\n","#text":" important to determine if the PP with the telescope is to be attached as a sister to the noun the man, restricting its interpretation, or if it is to be attached to the verb, thereby indicating the instrument of the main action described by the sentence. Based on examples of this sort, recent approaches have formalized the problem of disambiguating PP attachments as a binary choice, distinguishing between attachment of a PP to a given verb or to the verb’s direct object (Hindle and Rooth 1993; Ratnaparkhi, Reynar, and Roukos 1994; Collins and Brooks 1995; Merlo, Crocker, and Berthouzoz 1997; Stetina and Nagao 1997; Ratnaparkhi 1997; Zhao and Lin 2004). This is, however, a simplification of the problem, which does not take the nature of the attachment into account. Precisely, it does not distinguish PP arguments from * Linguistics Department, University of Geneva, 2 rue de Candolle, 1211 Gen`eve 4, Switzerland. † Department of Informatics, University of Sussex, Falmer, Brighton BN19QH, UK. Submission received: 28 November 2003; revised submission received: 22 June 2005; accepted for publication: 4 November 2005. © 2006 Association for Computational Linguistics Computational Linguistics Volume 32, Number","@endWordPosition":"350","@position":"2261","annotationId":"T13","@startWordPosition":"347","@citStr":"Stetina and Nagao 1997"},{"#tail":"\n","#text":"distribution’s shape. The range of a distribution might have the same value for a uniform distribution or a very skewed distribution. Intuitively, we would like a measure that tells us that the former corresponds to a verb with a much lower head dependence than the latter. Entropy is 4 The automatic annotation of nouns and verbs in the corpus has been done by matching them with the WordNet database files. Before doing the annotation, though, some preprocessing of the data was required to maximize the matching between our corpus and WordNet. The changes made were inspired by those described in Stetina and Nagao (1997, page 75). To lemmatize the words we used “morpha,” a lemmatizer developed by John A. Carroll and freely available at the address: http://www.informatics.susx.ac.uk./research/nlp/carroll/morph.html. Upon simple observation, it showed a better performance than the frequently used Porter Stemmer for this task. 351 Computational Linguistics Volume 32, Number 3 a more informative measure of the dispersion of a distribution, which depends both on the range and on the shape of a distribution. The head dependence measure based on entropy, then, is calculated as indicated in equation (7), which calcu","@endWordPosition":"5538","@position":"34546","annotationId":"T14","@startWordPosition":"5535","@citStr":"Stetina and Nagao (1997"}]},"title":{"#tail":"\n","#text":"Corpus based PP attachment ambiguity resolution with a semantic dictionary."},"booktitle":{"#tail":"\n","#text":"In Proceedings of the Fifth Workshop on Very Large Corpora,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Jiri Stetina"},{"#tail":"\n","#text":"Makoto Nagao"}]}}]}}}}
