{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"2000"},"rawString":{"#tail":"\n","#text":"T. Pedersen. 2000. A simple approach to building ensembles of naive bayesian classifiers for word sense disambiguation. In Proceedings of the First Annual Meeting of the North American Chapter of the Association for Computational Linguistics, pages 63-69, Seattle, WA, May."},"#text":"\n","pages":{"#tail":"\n","#text":"63--69"},"marker":{"#tail":"\n","#text":"Pedersen, 2000"},"location":{"#tail":"\n","#text":"Seattle, WA,"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":" the bigram and a particular word sense. Finally, note that the smallest decision trees are functionally equivalent to our benchmark methods. A decision tree with 1 leaf node and no internal nodes (1/1) acts as a majority classifier. A decision tree with 2 leaf nodes and 1 internal node (2/3) has the structure of a decision stump. 8 Discussion One of our long-term objectives is to identify a core set of features that will be useful for disambiguating a wide class of words using both supervised and unsupervised methodologies. We have presented an ensemble approach to word sense disambiguation (Pedersen, 2000) where multiple Naive Bayesian classifiers, each based on co— occurrence features from varying sized windows of context, is shown to perform well on the widely studied nouns interest and line. While the accuracy of this approach was as good as any previously published results, the learned models were complex and difficult to interpret, in effect acting as very accurate black boxes. Our experience has been that variations in learning algorithms are far less significant contributors to disambiguation accuracy than are variations in the feature set. In other words, an informative feature set will","@endWordPosition":"4662","@position":"26820","annotationId":"T1","@startWordPosition":"4661","@citStr":"Pedersen, 2000"}},"title":{"#tail":"\n","#text":"A simple approach to building ensembles of naive bayesian classifiers for word sense disambiguation."},"booktitle":{"#tail":"\n","#text":"In Proceedings of the First Annual Meeting of the North American Chapter of the Association for Computational Linguistics,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":{"#tail":"\n","#text":"T Pedersen"}}}}}}}
