{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"1983"},"rawString":{"#tail":"\n","#text":"Hindle, D. (1983). Deterministic parsing of syntactic non-fluencies. In Proc. of the 21st Annual Meeting, Association for Computational Linguistics, Cambridge, MA, pp. 123-128."},"#text":"\n","pages":{"#tail":"\n","#text":"123--128"},"marker":{"#tail":"\n","#text":"Hindle, 1983"},"location":{"#tail":"\n","#text":"Cambridge, MA,"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"man speech, then committing to an early and exclusive focus on processing fluent utterances is risky. In humans, speech production and speech processing are done incrementally, using contextual information from the earliest moments of processing (see, e.g., Tanenhaus et al. 1995). This sort of processing requires quite a different architecture and different mechanisms for ambiguity resolution than one that begins processing only at the end of a complete and well-formed utterance. Few approaches to parsing have tried to handle disfluent utterances (notable exceptions are Core & Schubert, 1999; Hindle, 1983; Nakatani & Hirschberg, 1994; Shriberg, Bear, & Dowding, 1992). The few psycholinguistic experiments that have examined human processing of disfluent speech also throw into question the assumption that disfluent speech is harder to process than fluent speech. Lickley and Bard (1996) found evidence that listeners may be relatively deaf to the words in a reparandum (the part that would need to be excised in order for the utterance to be fluent), and Shriberg and Lickley (1993) found that fillers such as um or uh may be produced with a distinctive intonation that helps listeners distinguish them","@endWordPosition":"1406","@position":"9189","annotationId":"T1","@startWordPosition":"1405","@citStr":"Hindle, 1983"}},"title":{"#tail":"\n","#text":"Deterministic parsing of syntactic non-fluencies."},"booktitle":{"#tail":"\n","#text":"In Proc. of the 21st Annual Meeting, Association for Computational Linguistics,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":{"#tail":"\n","#text":"D Hindle"}}}}}}}
