{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"2003"},"rawString":{"#tail":"\n","#text":"Dan Klein and Christopher D. Manning. 2003. Accurate unlexicalized parsing. In Proceedings of the 41st Annual Meeting of the Association for Computational Linguistics, pages 423–430. Association for Computational Linguistics, Sapporo, Japan."},"#text":"\n","pages":{"#tail":"\n","#text":"423--430"},"marker":{"#tail":"\n","#text":"Klein, Manning, 2003"},"location":{"#tail":"\n","#text":"Sapporo, Japan."},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"igger than the argument “&款” (conflicting with condition 2) while labeling the predicate “欠(”, so it has to be separated into two chunks. Note that the third condition also guarantees the constituents in C does not overlap with each other since each one is as large as possible. So we can still formulate our new shallow parsing as an “IOB” sequence labeling problem. 3.3 Chunk Type We introduce two types of chunks. The first is simply the phrase type, such as NP, PP, of current chunk. The column CHUNK 1 illustrates this kind of chunk type definition. The second is more complicated. Inspired by (Klein and Manning, 2003), we split one phrase type into several subsymbols, which contain category information of current constituent’s parent. For example, an NP immediately dominated by a S, will be substituted by NPˆS. This strategy severely increases the number of chunk types and make it hard to train chunking models. To shrink this number, we linguistically use a cluster of CTB phrasal types, which was introduced in (Sun and Sui, 2009). The column CHUNK 2 illustrates this definition. E.g., NPˆS implicitly represents Subject while NPˆVP represents Object. 3.4 New Path Features The Path feature is defined as a cha","@endWordPosition":"1774","@position":"10353","annotationId":"T1","@startWordPosition":"1770","@citStr":"Klein and Manning, 2003"}},"title":{"#tail":"\n","#text":"Accurate unlexicalized parsing."},"booktitle":{"#tail":"\n","#text":"In Proceedings of the 41st Annual Meeting of the Association for Computational Linguistics,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Dan Klein"},{"#tail":"\n","#text":"Christopher D Manning"}]}}}}}}
