{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"2005"},"rawString":{"#tail":"\n","#text":"Roberto Basili, Marco Cammisa, and Alessandro Moschitti. 2005. Effective use of WordNet semantics via kernel-based learning. In Proceedings of CoNLL-2005, pages 1–8, Ann Arbor, Michigan."},"#text":"\n","pages":{"#tail":"\n","#text":"1--8"},"marker":{"#tail":"\n","#text":"Basili, Cammisa, Moschitti, 2005"},"location":{"#tail":"\n","#text":"Ann Arbor, Michigan."},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"for the reranker and concluded that the structural learning framework seemed to give the best performance. We were not able to achieve the same performance using tree kernels as with manually extracted features. It is possible that this could be improved with a better strategy for representing dependency structure for tree kernels, or if the tree kernels could be incorporated into the structural learning framework. The flexible architecture we have presented enables interesting future research: (i) a straightforward improvement is the use of lexical similarity to reduce data sparseness, e.g. (Basili et al., 2005; Basili et al., 2006; Bloehdorn et al., 2006). However, the similarity between subjective words, which have multiple senses against other words may negatively impact the system accuracy. Therefore, the use of the syntactic/semantic kernels, i.e. (Bloehdorn and Moschitti, 2007a; Bloehdorn and Moschitti, 2007b), to syntactically contextualize word similarities may improve the reranker accuracy. (ii) The latter can be further boosted by studying complex structural kernels, e.g. (Moschitti, 2008; Nguyen et al., 2009; Dinarelli et al., 2009). (iii) More specific predicate argument structures such ","@endWordPosition":"5091","@position":"30880","annotationId":"T1","@startWordPosition":"5088","@citStr":"Basili et al., 2005"}},"title":{"#tail":"\n","#text":"Effective use of WordNet semantics via kernel-based learning."},"booktitle":{"#tail":"\n","#text":"In Proceedings of CoNLL-2005,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Roberto Basili"},{"#tail":"\n","#text":"Marco Cammisa"},{"#tail":"\n","#text":"Alessandro Moschitti"}]}}}}}}
