{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"date":{"#tail":"\n","#text":"2010"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"s a working solution that results in a significant improvement in translation quality. It is an alternative to the popular statistical compound splitting methods, such as the one by Koehn and Knight (2003), incorporating a greater amount of linguistic knowledge and offering morphological reduction even of simplex words to their base form in addition. It would be interesting to compare the relative performance of the two approaches systematically. Word reordering between German and English is a complex problem. Encouraged by the success of chunk-based verb reordering lattices on ArabicEnglish (Bisazza and Federico, 2010), we tried to adapt the same approach to the German-English language pair. It turned out that there is a larger variety of long reordering patterns in this case. Nevertheless, some experiments performed after 91 the official evaluation showed promising results. We plan to pursue this work in several directions: Defining a lattice weighting scheme that distinguishes between original word order and reordering paths could help the decoder select the more promising path through the lattice. Applying similar reordering rules to the training corpus would reduce the mismatch between the training data","@endWordPosition":"2394","@position":"14946","annotationId":"T1","@startWordPosition":"2391","@citStr":"Bisazza and Federico, 2010"}},"title":{"#tail":"\n","#text":"Chunkbased verb reordering in VSO sentences for ArabicEnglish statistical machine translation."},"#tail":"\n","institution":{"#tail":"\n","#text":"for Computational Linguistics."},"rawString":{"#tail":"\n","#text":"Arianna Bisazza and Marcello Federico. 2010. Chunkbased verb reordering in VSO sentences for ArabicEnglish statistical machine translation. In Proceedings of the Joint Fifth Workshop on Statistical Machine Translation and Metrics MATR, Uppsala, Sweden, July. Association for Computational Linguistics."},"#text":"\n","marker":{"#tail":"\n","#text":"Bisazza, Federico, 2010"},"publisher":{"#tail":"\n","#text":"Association"},"location":{"#tail":"\n","#text":"Uppsala, Sweden,"},"booktitle":{"#tail":"\n","#text":"In Proceedings of the Joint Fifth Workshop on Statistical Machine Translation and Metrics MATR,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Arianna Bisazza"},{"#tail":"\n","#text":"Marcello Federico"}]}}}}}}
