{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":[{"date":{"#tail":"\n","#text":"2008"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"responding variant based on source-side syntax, showing that target syntax is more benefitial, and unsuccessfully experimented with a model extension that jointly takes source and target syntax into account. Hierarchical phrase-based MT suffers from spurious ambiguity: A single translation for a given source sentence can usually be accomplished by many different PSCFG derivations. This problem is exacerbated by syntax-augmented MT with its thousands of nonterminals, and made even worse by its joint source-and-target extension. Future research should apply the work of Blunsom et al. (2008) and Blunsom and Osborne (2008), who marginalize over derivations to find the most probable translation rather than the most probable derivation, to these multi-nonterminal grammars. All source code underlying this work is available under the GNU Lesser General Public License as part of the ‘SAMT’ system at: www.cs.cmu.edu/˜zollmann/samt Acknowledgements This work is in part supported by NSF under the Cluster Exploratory program (grant NSF 0844507), and in part by the US DARPA GALE program. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily r","@endWordPosition":"3586","@position":"22590","annotationId":"T1","@startWordPosition":"3583","@citStr":"Blunsom and Osborne (2008)"}},"title":{"#tail":"\n","#text":"Probabilistic inference for machine translation."},"#tail":"\n","institution":{"#tail":"\n","#text":"for Computational Linguistics."},"rawString":{"#tail":"\n","#text":"Blunsom, Phil and Miles Osborne. 2008. Probabilistic inference for machine translation. In EMNLP ’08: Proceedings of the Conference on Empirical Methods in Natural Language Processing, pages 215– 223, Morristown, NJ, USA. Association for Computational Linguistics."},"#text":"\n","pages":{"#tail":"\n","#text":"215--223"},"marker":{"#tail":"\n","#text":"Blunsom, Osborne, 2008"},"publisher":{"#tail":"\n","#text":"Association"},"location":{"#tail":"\n","#text":"Morristown, NJ, USA."},"booktitle":{"#tail":"\n","#text":"In EMNLP ’08: Proceedings of the Conference on Empirical Methods in Natural Language Processing,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Phil Blunsom"},{"#tail":"\n","#text":"Miles Osborne"}]}},{"#tail":"\n","date":{"#tail":"\n","#text":"2008"},"rawString":{"#tail":"\n","#text":"Blunsom, Phil, Trevor Cohn, and Miles Osborne. 2008. A discriminative latent variable model for statistical machine translation. In Proceedings of the Annual Meeting of the Association for Computational Linguistics (ACL)."},"#text":"\n","marker":{"#tail":"\n","#text":"Blunsom, Cohn, Osborne, 2008"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":"rget-side syntax, to a corresponding variant based on source-side syntax, showing that target syntax is more benefitial, and unsuccessfully experimented with a model extension that jointly takes source and target syntax into account. Hierarchical phrase-based MT suffers from spurious ambiguity: A single translation for a given source sentence can usually be accomplished by many different PSCFG derivations. This problem is exacerbated by syntax-augmented MT with its thousands of nonterminals, and made even worse by its joint source-and-target extension. Future research should apply the work of Blunsom et al. (2008) and Blunsom and Osborne (2008), who marginalize over derivations to find the most probable translation rather than the most probable derivation, to these multi-nonterminal grammars. All source code underlying this work is available under the GNU Lesser General Public License as part of the ‘SAMT’ system at: www.cs.cmu.edu/˜zollmann/samt Acknowledgements This work is in part supported by NSF under the Cluster Exploratory program (grant NSF 0844507), and in part by the US DARPA GALE program. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the a","@endWordPosition":"3581","@position":"22559","annotationId":"T2","@startWordPosition":"3578","@citStr":"Blunsom et al. (2008)"}},"title":{"#tail":"\n","#text":"A discriminative latent variable model for statistical machine translation."},"booktitle":{"#tail":"\n","#text":"In Proceedings of the Annual Meeting of the Association for Computational Linguistics (ACL)."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Phil Blunsom"},{"#tail":"\n","#text":"Trevor Cohn"},{"#tail":"\n","#text":"Miles Osborne"}]}}]}}}}
