{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"2001"},"rawString":{"#tail":"\n","#text":"R. Barzilay and K. McKeown. 2001. Extracting Paraphrases from a Parallel Corpus. In Proceedings of the ACL, Toulouse, France."},"#text":"\n","marker":{"#tail":"\n","#text":"Barzilay, McKeown, 2001"},"location":{"#tail":"\n","#text":"Toulouse, France."},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":" being used. The current work has focussed on high-level mapping rules which can be used both for generation from databases and knowledge representations and also for generation from text. In future work, we will focus on mapping text (in monologue form) to dialogue. For this we need to combine the highlevel rules with rules for paraphrasing the text in the monologue with text for the dialogue acts that express the same information in dialogue form. For automatically extracting these surface level mappings we will draw on the approach to learning paraphrases from a corpus that is described in Barzilay and McKeown (2001). An important component of our future effort will be to evaluate whether automatically generating dialogues from naturally-occurring monologues, following the approach described here, results in dialogues that are fluent and coherent and preserve the information from the input monologue. Acknowledgements We would like to thank the anonymous reviewers of INLG2010 for their helpful comments and our colleagues in the Open University’s NLG group for stimulating discussions on the content of this paper. The research reported in this paper was carried out as part of the CODA project (COherent Dialo","@endWordPosition":"4703","@position":"28924","annotationId":"T1","@startWordPosition":"4700","@citStr":"Barzilay and McKeown (2001)"}},"title":{"#tail":"\n","#text":"Extracting Paraphrases from a Parallel Corpus."},"booktitle":{"#tail":"\n","#text":"In Proceedings of the ACL,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"R Barzilay"},{"#tail":"\n","#text":"K McKeown"}]}}}}}}
