{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"#tail":"\n","date":{"#tail":"\n","#text":"2012"},"rawString":{"#tail":"\n","#text":"Mehmet Ali Yatbaz, Enis Sert, and Deniz Yuret. 2012. Learning syntactic categories using paradigmatic representations of word context. In Proceedings of EMNLP."},"#text":"\n","marker":{"#tail":"\n","#text":"Yatbaz, Sert, Yuret, 2012"},"contexts":{"#tail":"\n","#text":"\n","context":{"#tail":"\n","#text":" an underlying model that could capture syntagmatic patterns in large word contexts, yet is flexible enough to deal with data sparseness, is desired. It is generally accepted that the semantics of verbs in particular are correlated with their syntagmatic properties (Levin, 1993; Hanks, 2013). This provides grounds to expect that such model has the potential to excel for verbs. To capture syntagmatic patterns, we choose in this work standard n-gram language models as the basis for a concrete model implementing our scheme. This choice is inspired by recent work on learning syntactic categories (Yatbaz et al., 2012), which successfully utilized such language models to represent word window contexts of target words. However, we note that other richer types of language models, such as class-based (Brown et al., 1992) or hybrid (Tan et al., 2012), can be seamlessly integrated into our scheme. Our evaluations suggest that our model is indeed particularly advantageous for measuring semantic similarity for verbs, while maintaining comparable or better performance with respect to competitive baselines for nouns. 2 Background In this section we provide additional details regarding previous works that we later us","@endWordPosition":"876","@position":"5814","annotationId":"T1","@startWordPosition":"873","@citStr":"Yatbaz et al., 2012"}},"title":{"#tail":"\n","#text":"Learning syntactic categories using paradigmatic representations of word context."},"booktitle":{"#tail":"\n","#text":"In Proceedings of EMNLP."},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Mehmet Ali Yatbaz"},{"#tail":"\n","#text":"Enis Sert"},{"#tail":"\n","#text":"Deniz Yuret"}]}}}}}}
