{"algorithms":{"#text":"\n","@version":"110505","algorithm":{"#tail":"\n","@name":"ParsCit","#text":"\n","@version":"110505","citationList":{"#tail":"\n","#text":"\n","citation":{"date":{"#tail":"\n","#text":"2009"},"contexts":{"#tail":"\n","#text":"\n","context":[{"#tail":"\n","#text":"e is not enough to build a high performance system; some external source of information is required. In most state-of-the-art systems for named-entity recognition (NER) this knowledge comes in two forms: domain-specific lexicons (lists of word types related to the desired named entity types) and word representations (either clusterings or vectorial representations of word types which capture some of their syntactic and semantic behavior and allow generalizing to unseen word types). Current state-of-the-art named entity recognition systems use Brown clusters as the form of word representation (Ratinov and Roth, 2009; Turian et al., 2010; Miller et al., 2004; Brown et al., 1992), or other cluster-based representations computed from private data (Lin and Wu, 2009). While very attractive due to their simplicity, generality, and hierarchical structure, Brown clusters are limited because the computational complexity of fitting a model scales quadratically with the number of words in the corpus, or the number of “base clusters” in some efficient implementations, making it infeasible to train it on large corpora or with millions of word types. Although some attempts have been made to train named-entity recognit","@endWordPosition":"262","@position":"1826","annotationId":"T1","@startWordPosition":"259","@citStr":"Ratinov and Roth, 2009"},{"#tail":"\n","#text":"es of word tokens of each type in the corpus. The Brown clustering algorithm works by starting with an initial assignment of word types to classes (which is usually either one unique class per type or a small number of seed classes corresponding to the most frequent types in the corpus), and then iteratively selecting the pair of classes to merge that would lead to the highest post-merge log-likelihood, doing so until all classes have been merged. This process produces a hierarchical clustering of the word types in the corpus, and these clusterings have been found useful in many applications (Ratinov and Roth, 2009; Koo et al., 2008; Miller et al., 2004). There are other similar models of distributional clustering of English words which can be similarly effective (Pereira et al., 1993). One limitation of Brown clusters is their computational complexity, as training takes O(kV 2 + N)x time to train, where k is the number of base clusters, V size of vocabulary, and N number of tokens. This is infeasible for large corpora with millions of word types. Another family of language models that produces embeddings is the neural language models. Neural language models generally work by mapping each word type to a","@endWordPosition":"1188","@position":"7523","annotationId":"T2","@startWordPosition":"1185","@citStr":"Ratinov and Roth, 2009"},{"#tail":"\n","#text":"ISCELLANEOUS. The Ontonotes dataset is substantially larger: it has 1.6M tokens total, with 1.4M for training, 100K for development, and 130k for testing. It also has eighteen entity types, a much larger set than the CoNLL dataset, including works of art, dates, cardinal numbers, languages, and events. The performance of NER systems is commonly measured in terms of precision, recall, and F1 on the sets of entities in the ground truth and returned by the system. 2.3.1 Baseline System In this section we describe in detail the baseline NER system we use. It is inspired by the system described in Ratinov and Roth (2009). Because NER annotations are commonly not nested (for example, in the text “the US Army”, “US Army” is treated as a single entity, instead of the location “US” and the organization “US Army”) it is possible to treat NER as a sequence labeling problem, where each token in the sentence receives a label which depends on which entity type it belongs to and its position in the entity. Following Ratinov and Roth (2009) we use the BILOU encoding, where each token can either BEGIN an entity, be INSIDE an entity, be the LAST token in an entity, be OUTSIDE an entity, or be the single UNIQUE token in an","@endWordPosition":"2239","@position":"13775","annotationId":"T3","@startWordPosition":"2236","@citStr":"Ratinov and Roth (2009)"},{"#tail":"\n","#text":"e clues used in text to highlight named entities, they cannot necessarily disambiguate entity types or detect named entities in special positions, such as the first tokens in a sentence. To solve these problems most NER systems incorporate some form of external knowledge. In our baseline system we use lexicons of months, days, person names, companies, job titles, places, events, organizations, books, films, and some minor others. These lexicons were gathered from US Census data, Wikipedia category pages, and Wikipedia redirects (and will be made publicly available upon publication). Following Ratinov and Roth (2009), we also compare the performance of our system with a system using features based on the Brown clusters of the word types in a document. Since, as seen in section 2.1, Brown clusters are hierarchical, we use features corresponding to prefixes of the path from the root to the leaf for each word type. More specifically, the feature templates of the baseline system are as follows. First for each token we compute: • its word type; • word type, after excluding digits and lowercasing it; • its capitalization pattern; • whether it is punctuation; • 4-character prefixes and suffixes; • character n-gr","@endWordPosition":"2506","@position":"15340","annotationId":"T4","@startWordPosition":"2503","@citStr":"Ratinov and Roth (2009)"},{"#tail":"\n","#text":"words which are among the 30K most frequent words in the vocabulary. Table 1 depicts the accuracy on Semantic Syntactic Task for models trained with 50 dimensions. We find that lexicon-infused embeddings perform better than Skip-gram. Further, lex-0.01 performs System Dev Test Baseline 92.22 87.93 Baseline + Brown 93.39 90.05 Baseline + Skip-gram 93.68 89.68 Baseline + LexEmb 93.81 89.56 Baseline + Gaz 93.69 89.27 Baseline + Gaz + Brown 93.88 90.67 Baseline + Gaz + Skip-gram 94.23 90.33 Baseline + Gaz + LexEmb 94.46 90.90 Ando and Zhang (2005) 93.15 89.31 Suzuki and Isozaki (2008) 94.48 89.92 Ratinov and Roth (2009) 93.50 90.57 Lin and Wu (2009) - 90.90 Table 2: Final NER F1 scores for the CoNLL 2003 shared task. On the top are the systems presented in this paper, and on the bottom we have baseline systems. The best results within each area are highlighted in bold. Lin and Wu 2009 use massive private industrial query-log data in training. the best, and we use this model for further NER experiments. There was no perceptible difference in computation cost from learning lexicon-infused embeddings versus learning standard Skip-gram embeddings. 4.2 CoNLL 2003 NER We applied our models on CoNLL 2003 NER data s","@endWordPosition":"4401","@position":"26503","annotationId":"T5","@startWordPosition":"4398","@citStr":"Ratinov and Roth (2009)"}]},"title":{"#tail":"\n","#text":"Design challenges and misconceptions in named entity recognition."},"#tail":"\n","institution":{"#tail":"\n","#text":"for Computational Linguistics."},"rawString":{"#tail":"\n","#text":"Lev Ratinov and Dan Roth. 2009. Design challenges and misconceptions in named entity recognition. In Proceedings of the Thirteenth Conference on Computational Natural Language Learning, pages 147– 155. Association for Computational Linguistics."},"#text":"\n","pages":{"#tail":"\n","#text":"147--155"},"marker":{"#tail":"\n","#text":"Ratinov, Roth, 2009"},"publisher":{"#tail":"\n","#text":"Association"},"booktitle":{"#tail":"\n","#text":"In Proceedings of the Thirteenth Conference on Computational Natural Language Learning,"},"@valid":"true","authors":{"#tail":"\n","#text":"\n","author":[{"#tail":"\n","#text":"Lev Ratinov"},{"#tail":"\n","#text":"Dan Roth"}]}}}}}}
